# Xilinx Design Constraints

create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]

set_input_delay -clock clk -min 0 [get_ports N_cycles_tc]
set_input_delay -clock clk -max 10 [get_ports N_cycles_tc]
set_input_delay -clock clk -min 0 [get_ports N_inputs_tc]
set_input_delay -clock clk -max 10 [get_ports N_inputs_tc]
set_input_delay -clock clk -min 0 [get_ports N_neurons_tc]
set_input_delay -clock clk -max 10 [get_ports N_neurons_tc]
set_input_delay -clock clk -min 0 [get_ports bram_sel]
set_input_delay -clock clk -max 10 [get_ports bram_sel]
set_input_delay -clock clk -min 0 [get_ports di]
set_input_delay -clock clk -max 10 [get_ports di]
set_input_delay -clock clk -min 0 [get_ports init_lfsr]
set_input_delay -clock clk -max 10 [get_ports init_lfsr]
set_input_delay -clock clk -min 0 [get_ports init_v_th]
set_input_delay -clock clk -max 10 [get_ports init_v_th]
set_input_delay -clock clk -min 0 [get_ports init_value]
set_input_delay -clock clk -max 10 [get_ports init_value]
set_input_delay -clock clk -min 0 [get_ports input_data]
set_input_delay -clock clk -max 10 [get_ports input_data]
set_input_delay -clock clk -min 0 [get_ports input_data_addr]
set_input_delay -clock clk -max 10 [get_ports input_data_addr]
set_input_delay -clock clk -min 0 [get_ports load_inh_weight]
set_input_delay -clock clk -max 10 [get_ports load_inh_weight]
set_input_delay -clock clk -min 0 [get_ports load_input_data]
set_input_delay -clock clk -max 10 [get_ports load_input_data]
set_input_delay -clock clk -min 0 [get_ports load_v_reset]
set_input_delay -clock clk -max 10 [get_ports load_v_reset]
set_input_delay -clock clk -min 0 [get_ports rden]
set_input_delay -clock clk -max 10 [get_ports rden]
set_input_delay -clock clk -min 0 [get_ports rst_n]
set_input_delay -clock clk -max 10 [get_ports rst_n]
set_input_delay -clock clk -min 0 [get_ports seed]
set_input_delay -clock clk -max 10 [get_ports seed]
set_input_delay -clock clk -min 0 [get_ports start]
set_input_delay -clock clk -max 10 [get_ports start]
set_input_delay -clock clk -min 0 [get_ports v_th_addr]
set_input_delay -clock clk -max 10 [get_ports v_th_addr]
set_input_delay -clock clk -min 0 [get_ports wraddr]
set_input_delay -clock clk -max 10 [get_ports wraddr]
set_input_delay -clock clk -min 0 [get_ports wren]
set_input_delay -clock clk -max 10 [get_ports wren]


set_output_delay -clock clk -min 0 [get_ports cnt_out]
set_output_delay -clock clk -max 10 [get_ports cnt_out]
set_output_delay -clock clk -min 0 [get_ports ready]
set_output_delay -clock clk -max 10 [get_ports ready]
